app/views/recipes/public_recipe.html.erb

SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 9]]
SELECT COUNT(*) FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 9]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        <div>
            <h1>Total Food of item: <%= recipe.recipe_foods.count %></h1>
            <h1>Total Price: <%= recipe.recipe_foods.sum { |recipe_food| recipe_food.food.price } %></h1>