app/views/recipes/show.html.erb

  <tbody>
    <% @recipe.recipe_foods.each do |ingredient| %>
---
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 9]]