app/views/shopping_lists/index.html.erb

SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 8]]
SELECT COUNT(*) FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 9]]
---
<div class='shopping_lists'>
<h2>Amount of food items to buy: <%= @recipe.recipe_foods.count %> </h2>