app/views/recipe_foods/new.html.erb

    <%= form.label :food_id %>
    <%= form.collection_select :food_id, Food.all, :id, :name %>
---
SELECT "foods".* FROM "foods"