app/controllers/foods_controller.rb

  def index
    @user = User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @food = current_user.foods.new(food_params)
    @food.user = current_user

    if @food.save
---
INSERT INTO "foods" ("name", "measurement_unit", "price", "quantity", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "tomato"], ["measurement_unit", nil], ["price", 12], ["quantity", 12], ["user_id", 1], ["created_at", "2023-05-31 11:07:20.824962"], ["updated_at", "2023-05-31 11:07:20.824962"]]