app/controllers/recipes_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @recipe = Recipe.find(params[:id])
        @user = User.find(params[:user_id])