app/controllers/shopping_lists_controller.rb

  def index
    @recipe = Recipe.find(params[:recipe_id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def create_shopping_list(recipe)
    shopping_list = {}

    recipe.recipe_foods.each do |recipe_food|
---
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 8]]

  def find_missing_foods(shopping_list)
    all_foods = Food.pluck(:name)
---
SELECT "foods"."name" FROM "foods"